# Завдання 2
import pandas as pd

data = pd.read_csv('titanic.csv')


# 1. Яка кількість чоловіків та жінок пливла на кораблі?
count_gender = data['sex'].value_counts()
print(f"Кількість чоловіків:{count_gender['male']}")
print(f"Кількість жінок: {count_gender['female']}")


# 2. Яку частину пасажирів вдалося вижити? Порахуйте частку пасажирів, що вижили. Відповідь наведіть у
# відсотках (число в інтервалі від 0 до 100, знак відсотка не потрібен), округливши до двох символів.
survivors = data['survived'].mean() * 100
print('Частина виживших пасажирів: {:.2f}'.format(survivors))


# 3. Яку частку пасажири першого класу складали серед всіх пасажирів?
# Відповідь наведіть у відсотках(число в інтервалі від 0 до 100, знак відсотка не потрібний), округливши до двох знаків.
first_class_pass = (data['pclass'] == 1).mean() * 100
print('Частка пасажирів першого класу серед пасажирів: {:.2f}'.format(first_class_pass))


# 4. Якого віку були пасажири? Порахуйте середнє та медіану віку пасажирів.
# Як відповідь наведіть дві числа через пропуск.
mean_age = data['age'].mean()
median_age = data['age'].median()
print(f'Середній вік та медіана віку пасажирів: {mean_age} {median_age}')
